twitter/app/views/users/_user.html.erb

  <% else %>
  <em><%= user.username %> has no followers :(</em>
  <% end %>

  <% if user.followeds.count > 0 %>
    <h3>Following</h3>
    <ul>
    <% user.followeds.each do |f| %>
      <li><%= link_to f.username, user_path(f) %></li>
    <% end %>
    </ul>
  <% end %>

</div>

---
SELECT "users".* FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ?  [["follower_id", 41]]
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."followed_id" WHERE "relationships"."follower_id" = ?  [["follower_id", 41]]