twitter/app/views/users/show.html.erb

<ul>
<% @user.tweets.each do |tweet| %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 79]]